#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01YTQwYjI3NC02NmM2LTQ4MTgtYTdlMS02Y2E3ODY3MDEyNTg7b2JqZWN0SWQ9ODY0YzYxYzAtZTAwMi00MzIwLTlhZWEtYWEyMWZkMjVhOTAzO3N1YnNjcmlwdGlvbklkPTJkOTllYTk3LWUwN2MtNDEyMy1hMzRjLTI1Nzg3NTMxZTVhOTt0ZW5hbnRJZD1hYzJmZmQ3Yy1kYTg1LTQ3NjUtYWY4NC0xZjE0MTcxNzNiOTQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "pappu-dev-api"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "pappu"
      + revision_mode                 = "Single"
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = (known after apply)
          + username             = (known after apply)
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + cooldown_period_in_seconds       = 300
          + max_replicas                     = 10
          + min_replicas                     = 0
          + polling_interval_in_seconds      = 30
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/k8se/quickstart:latest"
              + memory            = "1.0Gi"
              + name              = "api"

              + env {
                  + name  = "STORAGE_ACCOUNT_NAME"
                  + value = "pappudevpdfsa"
                }
              + env {
                  + name  = "PDF_CONTAINER_NAME"
                  + value = "pdf-uploads"
                }
              + env {
                  + name  = "AZURE_CLIENT_ID"
                  + value = (known after apply)
                }
            }
        }
    }

  # azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "pappu-dev-cae"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + public_network_access            = (known after apply)
      + resource_group_name              = "pappu"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + zone_redundancy_enabled          = false
    }

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "pappudevacr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "pappu"
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "pappu-dev-kv"
      + public_network_access_enabled = false
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = true
      + resource_group_name           = "pappu"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + tenant_id                     = "ac2ffd7c-da85-4765-af84-1f1417173b94"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = "AzureServices"
          + default_action             = "Deny"
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "pappu"
      + tags     = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
    }

  # azurerm_role_assignment.aca_blob_contributor will be created
  + resource "azurerm_role_assignment" "aca_blob_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.pdf will be created
  + resource "azurerm_storage_account" "pdf" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "westeurope"
      + min_tls_version                    = "TLS1_2"
      + name                               = "pappudevpdfsa"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "pappu"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "106.222.200.124",
              + "106.222.202.205",
              + "106.222.203.170",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_storage_container.pdf_uploads will be created
  + resource "azurerm_storage_container" "pdf_uploads" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "pdf-uploads"
      + resource_manager_id               = (known after apply)
      + storage_account_id                = (known after apply)
    }

  # azurerm_subnet.aca will be created
  + resource "azurerm_subnet" "aca" {
      + address_prefixes                              = [
          + "10.10.2.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "pappu-dev-snet-aca"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "pappu"
      + service_endpoints                             = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "pappu-dev-vnet"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.App/environments"
            }
        }
    }

  # azurerm_subnet.app will be created
  + resource "azurerm_subnet" "app" {
      + address_prefixes                              = [
          + "10.10.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "pappu-dev-subnet-app"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "pappu"
      + service_endpoints                             = [
          + "Microsoft.KeyVault",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                          = "pappu-dev-vnet"
    }

  # azurerm_user_assigned_identity.aca will be created
  + resource "azurerm_user_assigned_identity" "aca" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "pappu-dev-aca-id"
      + principal_id        = (known after apply)
      + resource_group_name = "pappu"
      + tags                = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.10.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "pappu-dev-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "pappu"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "dev"
          + "managed_by"  = "terraform"
          + "owner"       = "data-engineering"
          + "project"     = "pappu"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server              = (known after apply)
  + app_subnet_id                 = (known after apply)
  + container_app_fqdn            = (known after apply)
  + key_vault_name                = "pappu-dev-kv"
  + location                      = "westeurope"
  + pdf_container_name            = "pdf-uploads"
  + resource_group_name           = "pappu"
  + storage_account_blob_endpoint = (known after apply)
  + storage_account_name          = "pappudevpdfsa"
  + virtual_network_id            = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @sreedath19, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Plan`*